valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
    /* Display ON */
    lcd_write_command(0x29);
    HAL_Delay(50);   /* DÜZƏLİŞ: Display ON-dan sonra gözlə */
    
    /* Memory Write - RAM-a yazmağa hazırla */
    lcd_write_command(0x2C);
    
    /* DÜZƏLİŞ: ColorTest silindi - birbaşa əsas ekrana keç */
    /* Ekranı qara rənglə təmizlə */
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
}

/* LCD rəng testi - başlatma uğurlu olduğunu yoxlamaq üçün */
void ILI9341_ColorTest(void)
{
    /* DÜZƏLİŞ: Backlight həm HIGH həm də LOW vəziyyətdə test edilir */
    /* Bəzi LCD modulları inverted backlight istifadə edir */
    
    /* Test 1: Qırmızı ekran - backlight HIGH */
    HAL_GPIO_WritePin(LCD_LIG_GPIO_Port, LCD_LIG_Pin, GPIO_PIN_SET);
    ILI9341_FillScreen(ILI9341_COLOR_RED);
    HAL_Delay(300);
    
    /* Test 2: Yaşıl ekran */
    ILI9341_FillScreen(ILI9341_COLOR_GREEN);
    HAL_Delay(300);
    
    /* Test 3: Mavi ekran */
    ILI9341_FillScreen(ILI9341_COLOR_BLUE);
    HAL_Delay(300);
    
    /* Test 4: Ağ ekran */
    ILI9341_FillScreen(ILI9341_COLOR_WHITE);
    HAL_Delay(300);
    
    /* Test 5: Backlight LOW (inverted polarity test) */
    /* Əgər ekran bu anda yanırsa, backlight inverted-dir */
    HAL_GPIO_WritePin(LCD_LIG_GPIO_Port, LCD_LIG_Pin, GPIO_PIN_RESET);
    ILI9341_FillScreen(ILI9341_COLOR_YELLOW);
    HAL_Delay(500);
    
    /* DÜZƏLİŞ: Backlight yenidən HIGH-a qaytar */
    /* Əgər ekran sarı (YELLOW) göstərirsə, backlight normal (HIGH aktiv) */
    /* Əgər ekran sarı göstərmirsə amma HIGH-da göstərirdisə, backlight inverted */
    HAL_GPIO_WritePin(LCD_LIG_GPIO_Port, LCD_LIG_Pin, GPIO_PIN_SET);
    
    /* Son: Qara ekran */
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
}

/* Backlight-ı invert etmək üçün funksiya */
void ILI9341_SetBacklight(uint8_t on)
{
    /* on = 1: Backlight ON, on = 0: Backlight OFF */
    /* DÜZƏLİŞ: Əgər LCD-də backlight inverted-dirsə, bu funksiyanı dəyişdirin */
    /* Normal: HIGH = ON, LOW = OFF */
    /* Inverted: HIGH = OFF, LOW = ON */
    #define BACKLIGHT_INVERTED 0  /* DÜZƏLİŞ: Əgər ekran yanmırsa, bu dəyəri 1-ə dəyişin */
    
    #if BACKLIGHT_INVERTED
        HAL_GPIO_WritePin(LCD_LIG_GPIO_Port, LCD_LIG_Pin, on ? GPIO_PIN_RESET : GPIO_PIN_SET);
    #else
        HAL_GPIO_WritePin(LCD_LIG_GPIO_Port, LCD_LIG_Pin, on ? GPIO_PIN_SET : GPIO_PIN_RESET);
    #endif
}

/* ------------------ Ekranı rənglə doldur ------------------ */
void ILI9341_FillScreen(uint16_t color)
{
    uint32_t px = 320UL * 240UL;

    /* RAM write (CASET/RASET landscape 320x240) */
    lcd_write_command(0x2A);  /* Column addr set */
    lcd_write_data(0x00); lcd_write_data(0x00);
    lcd_write_data(0x01); lcd_write_data(0x3F); /* 319 */

    lcd_write_command(0x2B);  /* Row addr set */
    lcd_write_data(0x00); lcd_write_data(0x00);
    lcd_write_data(0x00); lcd_write_data(0xEF); /* 239 */

    lcd_write_command(0x2C);  /* RAMWR */

    while (px--) {
        LCD_RAM = color;
    }
}

/* ------------------ Pixel çək ------------------ */
void ILI9341_DrawPixel(uint16_t x, uint16_t y, uint16_t color)
{
    if (x >= 320 || y >= 240) return;

    /* Set address */
    lcd_write_command(0x2A);
    lcd_write_data(x >> 8); lcd_write_data(x & 0xFF);
    lcd_write_data(x >> 8); lcd_write_data(x & 0xFF);

    lcd_write_command(0x2B);
    lcd_write_data(y >> 8); lcd_write_data(y & 0xFF);
    lcd_write_data(y >> 8); lcd_write_data(y & 0xFF);

    lcd_write_command(0x2C);
    LCD_RAM = color;
}

/* ------------------ Düzbucaqlı çək (dolu) - OPTİMAL ------------------ */
void ILI9341_DrawRectangle(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t color)
{
    /* FillRect ilə eynidir - optimal versiya istifadə et */
    ILI9341_FillRect(x, y, width, height, color);
}

/* ------------------ Dolu düzbucaqlı (FillRect) - OPTİMAL ------------------ */
void ILI9341_FillRect(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t color)
{
    /* Sərhədləri yoxla */
    if (x >= 320 || y >= 240) return;
    if (x + width > 320) width = 320 - x;
    if (y + height > 240) height = 240 - y;
    if (width == 0 || height == 0) return;
    
    uint16_t x_end = x + width - 1;
    uint16_t y_end = y + height - 1;
    
    /* Pəncərə təyin et */
    lcd_write_command(0x2A);  /* Column Address Set */
    lcd_write_data(x >> 8);
    lcd_write_data(x & 0xFF);
    lcd_write_data(x_end >> 8);
    lcd_write_data(x_end & 0xFF);
    
    lcd_write_command(0x2B);  /* Row Address Set */
    lcd_write_data(y >> 8);
    lcd_write_data(y & 0xFF);
    lcd_write_data(y_end >> 8);
    lcd_write_data(y_end & 0xFF);
    
    lcd_write_command(0x2C);  /* Memory Write */
    
    /* Bütün pikselləri yaz */
    uint32_t total_pixels = (uint32_t)width * (uint32_t)height;
    while (total_pixels--) {
        LCD_RAM = color;
    }
}

/* ------------------ Horizontal xətt - OPTİMAL ------------------ */
void ILI9341_DrawHLine(uint16_t x, uint16_t y, uint16_t width, uint16_t color)
{
    if (y >= 240 || x >= 320) return;
    if (x + width > 320) width = 320 - x;
    if (width == 0) return;
    
    uint16_t x_end = x + width - 1;
    
    lcd_write_command(0x2A);
    lcd_write_data(x >> 8);
    lcd_write_data(x & 0xFF);
    lcd_write_data(x_end >> 8);
    lcd_write_data(x_end & 0xFF);
    
    lcd_write_command(0x2B);
    lcd_write_data(y >> 8);
    lcd_write_data(y & 0xFF);
    lcd_write_data(y >> 8);
    lcd_write_data(y & 0xFF);
    
    lcd_write_command(0x2C);
    for (uint16_t i = 0; i < width; i++) {
        LCD_RAM = color;
    }
}

/* ------------------ Vertical xətt - OPTİMAL ------------------ */
void ILI9341_DrawVLine(uint16_t x, uint16_t y, uint16_t height, uint16_t color)
{
    if (x >= 320 || y >= 240) return;
    if (y + height > 240) height = 240 - y;
    if (height == 0) return;
    
    uint16_t y_end = y + height - 1;
    
    lcd_write_command(0x2A);
    lcd_write_data(x >> 8);
    lcd_write_data(x & 0xFF);
    lcd_write_data(x >> 8);
    lcd_write_data(x & 0xFF);
    
    lcd_write_command(0x2B);
    lcd_write_data(y >> 8);
    lcd_write_data(y & 0xFF);
    lcd_write_data(y_end >> 8);
    lcd_write_data(y_end & 0xFF);
    
    lcd_write_command(0x2C);
    for (uint16_t i = 0; i < height; i++) {
        LCD_RAM = color;
    }
}

