valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
    // Duty Cycle section
    ILI9341_DrawString(50, 60, "Duty Cycle", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 2);
    char duty_str[20];
    sprintf(duty_str, "%.1f%%", motor_duty_cycle);
    ILI9341_DrawString(100, 85, duty_str, ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawControlButton(50, 110, 40, 30, ILI9341_COLOR_WHITE, "-", 2);
    ILI9341_DrawControlButton(200, 110, 40, 30, ILI9341_COLOR_WHITE, "+", 2);
    
    // Frequency section
    ILI9341_DrawString(50, 150, "Frequency", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 2);
    char freq_str[20];
    sprintf(freq_str, "%.0f Hz", motor_frequency);
    ILI9341_DrawString(100, 175, freq_str, ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawControlButton(50, 190, 40, 30, ILI9341_COLOR_WHITE, "-", 2);
    ILI9341_DrawControlButton(200, 190, 40, 30, ILI9341_COLOR_WHITE, "+", 2);
    
    // Back button - moved to upper left
    ILI9341_DrawControlButton(20, 20, 80, 25, ILI9341_COLOR_WHITE, "Back", 1);
}
*/

/* Touch Calibration page */
void ILI9341_ShowCalibrationPage(void)
{
    pressure_control_page = 7;
    
    // Clear screen
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    // Title
    ILI9341_DrawString(80, 20, "TOUCH CALIBRATION", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    
    // Instructions
    ILI9341_DrawString(20, 50, "Touch the screen to see coordinates", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    ILI9341_DrawString(20, 70, "Raw X/Y values will be shown below", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    
    // Current calibration values
    uint16_t x_min, x_max, y_min, y_max;
    XPT2046_GetCalibration(&x_min, &x_max, &y_min, &y_max);
    
    char calib_info[60];
    sprintf(calib_info, "X: %d-%d, Y: %d-%d", x_min, x_max, y_min, y_max);
    ILI9341_DrawString(20, 100, calib_info, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    
    // Coordinate mode buttons
    ILI9341_DrawControlButton(20, 130, 60, 30, ILI9341_COLOR_WHITE, "Mode 0", 1);
    ILI9341_DrawControlButton(90, 130, 60, 30, ILI9341_COLOR_WHITE, "Mode 1", 1);
    ILI9341_DrawControlButton(160, 130, 60, 30, ILI9341_COLOR_WHITE, "Mode 2", 1);
    ILI9341_DrawControlButton(230, 130, 60, 30, ILI9341_COLOR_WHITE, "Mode 3", 1);
    
    // Back button
    ILI9341_DrawControlButton(20, 200, 80, 30, ILI9341_COLOR_WHITE, "Back", 1);
}

/* Pressure Sensor Calibration page */
void ILI9341_ShowPressureCalibrationPage(void)
{
    pressure_control_page = 8; // New page for pressure sensor calibration
    
    // Clear screen
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    // Title
    ILI9341_DrawString(60, 20, "PRESSURE SENSOR", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    ILI9341_DrawString(80, 45, "CALIBRATION", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    
    // DÜZƏLİŞ: Kalibrləmə dəyərlərini Advanced sistemdən götür
    extern CalibrationData_t g_calibration;
    
    // Update UI variables from Advanced system calibration (for consistency)
    bool calibration_valid = ILI9341_IsPressureCalibrationValid(&g_calibration);
    if (!calibration_valid) {
        // Invalid or uninitialized calibration data - use safe defaults for UI only
        adc_min = ADC_MIN;
        adc_max = ADC_MAX;
        min_pressure = PRESSURE_MIN;
        max_pressure = PRESSURE_MAX;

        if (g_calibration.calibrated) {
            printf("WARNING: UI detected suspicious calibration values (ADC: %.0f-%.0f, Pressure: %.1f-%.1f). Using defaults for display only.\r\n",
                   g_calibration.adc_min, g_calibration.adc_max,
                   g_calibration.pressure_min, g_calibration.pressure_max);
        }
    } else {
        adc_min = (uint16_t)(g_calibration.adc_min + 0.5f);
        adc_max = (uint16_t)(g_calibration.adc_max + 0.5f);
        min_pressure = g_calibration.pressure_min;
        max_pressure = g_calibration.pressure_max;
    }
    
    // Current calibration values display
    char min_volt_str[30], max_volt_str[30];
    char min_press_str[30], max_press_str[30];
    char adc_min_str[30], adc_max_str[30];
    sprintf(min_volt_str, "Min Volt: %.1fV", min_voltage);
    sprintf(max_volt_str, "Max Volt: %.1fV", max_voltage);
    sprintf(min_press_str, "Min Press: %.1f bar", min_pressure);
    sprintf(max_press_str, "Max Press: %.1f bar", max_pressure);
    sprintf(adc_min_str, "ADC Min: %d", adc_min);
    sprintf(adc_max_str, "ADC Max: %d", adc_max);
    
    ILI9341_DrawString(20, 80, min_volt_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    ILI9341_DrawString(20, 100, max_volt_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    ILI9341_DrawString(20, 120, min_press_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    ILI9341_DrawString(20, 140, max_press_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    ILI9341_DrawString(20, 150, adc_min_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    ILI9341_DrawString(20, 160, adc_max_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    
    /* Current ADC reading - will be updated in real-time */
    char adc_str[30];
    sprintf(adc_str, "ADC: %d", adc_min); /* Initial value */
    ILI9341_DrawString(20, 170, adc_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
    
    /* Instructions */
    ILI9341_DrawString(20, 180, "Touch CAL MIN/MAX to calibrate", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 1);
    
    /* Calibration buttons - larger for easier touch */
    ILI9341_DrawControlButton(20, 200, 90, 40, ILI9341_COLOR_WHITE, "CAL MIN", 1);
    ILI9341_DrawControlButton(120, 200, 90, 40, ILI9341_COLOR_WHITE, "CAL MAX", 1);
    ILI9341_DrawControlButton(220, 200, 90, 40, ILI9341_COLOR_WHITE, "SAVE", 1);
    
    /* Back button */
    ILI9341_DrawControlButton(20, 250, 90, 40, ILI9341_COLOR_WHITE, "BACK", 1);
}

/* PID Tuning page */
void ILI9341_ShowPIDTuningPage(void)
{
    pressure_control_page = 9;
    
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    ILI9341_DrawString(85, 15, "PID TUNING", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
    
    // KRİTİK DÜZƏLİŞ: Manual ADC oxunması silindi - yalnız PID sistemindən təzyiq götürülür
    // PID sistemi hər 10ms-də bir ADC oxuyur və g_system_status.current_pressure-ı yeniləyir
    // Bu, ADC kanallarının ziddiyyətini və loop qeyri-dəqiqliyini aradan qaldırır
    SystemStatus_t* status = AdvancedPressureControl_GetStatus();
    float current_pressure_val = status->current_pressure;
    
    // Update status with latest pressure reading
    status->current_pressure = current_pressure_val;
    
