valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
void ILI9341_HandleCalibrationTouch(void)
{
    /* Handle calibration touch events */
    if (pressure_control_page == 8) {
        /* Update ADC reading display */
        static uint32_t last_adc_update = 0;
        uint32_t current_time = HAL_GetTick();
        
        if (current_time - last_adc_update > 200) { /* Update every 200ms for better responsiveness */
            last_adc_update = current_time;
            
            /* KRİTİK DÜZƏLİŞ: ADC oxunması PID sistemindən götürülür - ADC bloklanması yoxdur */
            SystemStatus_t* status = AdvancedPressureControl_GetStatus();
            uint16_t adc_value = status->raw_adc_value;  // Xam ADC dəyəri Status-dan
            
            /* Update display with current ADC value */
            char adc_str[30];
            sprintf(adc_str, "ADC: %d", adc_value);
            ILI9341_DrawString(20, 170, adc_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
            
            /* PID sistemindən təzyiq dəyərini götür */
            float current_pressure = status->current_pressure;
            char pressure_str[30];
            sprintf(pressure_str, "Pressure: %.1f bar", current_pressure);
            ILI9341_DrawString(20, 180, pressure_str, ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
            
            /* Show calibration values */
            char debug_cal_str[50];
            sprintf(debug_cal_str, "Cal: %d-%d -> %.1f-%.1f", adc_min, adc_max, min_pressure, max_pressure);
            ILI9341_DrawString(20, 190, debug_cal_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
            /* KRİTİK DÜZƏLİŞ: HAL_ADC_Stop() silindi - artıq manual ADC oxunması yoxdur */
            /* ADC dəyəri Status-dan götürülür, ona görə də Stop() lazım deyil */
        }
    }
}

/* ==================== AUTO MODE CONTROL FUNCTIONS ==================== */

/* AutoMode functions - REMOVED (AutoMode deleted) */

/* ==================== 3-NÖQTƏLİ TOUCH KALİBRASİYA ==================== */

/**
 * @brief Kalibrasiya nişanı (hədəf) çək
 * @param x, y: Nişanın mərkəzi
 * @param color: Nişanın rəngi
 */
void ILI9341_DrawCalibrationTarget(uint16_t x, uint16_t y, uint16_t color)
{
    /* Böyük + işarəsi çək */
    ILI9341_DrawHLine(x - 15, y, 31, color);      /* Horizontal xətt */
    ILI9341_DrawVLine(x, y - 15, 31, color);      /* Vertical xətt */
    
    /* Mərkəzdə kiçik dairə */
    for (int dx = -3; dx <= 3; dx++) {
        for (int dy = -3; dy <= 3; dy++) {
            if (dx*dx + dy*dy <= 9) {
                ILI9341_DrawPixel(x + dx, y + dy, color);
            }
        }
    }
    
    /* Xarici dairə */
    for (int angle = 0; angle < 360; angle += 10) {
        float rad = angle * 3.14159f / 180.0f;
        int px = x + (int)(12.0f * cosf(rad));
        int py = y + (int)(12.0f * sinf(rad));
        ILI9341_DrawPixel(px, py, color);
    }
}

/**
 * @brief Sürətli touch test və avtomatik kalibrasiya
 * @note 3 nöqtəli kalibrasiya - sol üst, sağ üst, alt mərkəz
 * @return 1 uğurlu, 0 xəta
 */
uint8_t ILI9341_RunTouchCalibration(void)
{
    printf("=== TOUCH CALIBRATION ===\r\n");
    
    /* Default kalibrasiya dəyərlərini yüklə */
    XPT2046_LoadDefaultCalibration();
    
    /* 3 kalibrasiya nöqtəsi */
    const uint16_t cal_points[3][2] = {
        {30, 30},      /* Sol üst */
        {290, 30},     /* Sağ üst */
        {160, 210}     /* Alt mərkəz */
    };
    
    uint16_t raw_points[3][2] = {0};
    uint8_t points_collected = 0;
    
    /* Hər nöqtə üçün touch oxu */
    for (int point = 0; point < 3; point++) {
        ILI9341_FillScreen(ILI9341_COLOR_BLACK);
        
        /* Başlıq */
        char title[32];
        sprintf(title, "POINT %d/3", point + 1);
        ILI9341_DrawString(100, 60, title, ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 2);
        ILI9341_DrawString(30, 100, "Touch the red target", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
        
        /* Hədəf çək */
        ILI9341_DrawCalibrationTarget(cal_points[point][0], cal_points[point][1], ILI9341_COLOR_RED);
        
        /* 5 saniyə gözlə */
        uint32_t timeout = HAL_GetTick() + 5000;
        uint8_t got_touch = 0;
        
        while (!got_touch && HAL_GetTick() < timeout) {
            if (XPT2046_IsTouched()) {
                HAL_Delay(50);  /* Debounce */
                if (XPT2046_IsTouched()) {
                    uint16_t rx, ry;
                    if (XPT2046_GetCoordinates(&rx, &ry)) {
                        raw_points[point][0] = rx;
                        raw_points[point][1] = ry;
                        got_touch = 1;
                        points_collected++;
                        
                        printf("Point %d: raw(%d,%d) -> screen(%d,%d)\r\n", 
                               point + 1, rx, ry, cal_points[point][0], cal_points[point][1]);
                        
                        /* Uğurlu işarəsi */
                        ILI9341_DrawString(130, 150, "OK!", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 2);
                        HAL_Delay(500);
                        
                        /* Touch buraxılmasını gözlə */
                        while (XPT2046_IsTouched()) {
                            HAL_Delay(10);
                        }
                        HAL_Delay(200);
                    }
                }
            }
            HAL_Delay(30);
        }
        
        if (!got_touch) {
            printf("Point %d: TIMEOUT\r\n", point + 1);
        }
    }
    
    /* Nəticə */
    ILI9341_FillScreen(ILI9341_COLOR_BLACK);
    
    if (points_collected >= 2) {
        /* Ən azı 2 nöqtə ilə ən yaxşı modu tap */
        printf("Testing all 8 modes...\r\n");
        
        uint8_t best_mode = 0;
        int32_t best_error = 0x7FFFFFFF;
        
        /* İlk iki nöqtəyə görə bütün modları sına */
        for (uint8_t mode = 0; mode < 8; mode++) {
            XPT2046_SetCoordMode(mode);
            int32_t total_error = 0;
            
            for (int p = 0; p < 2; p++) {
                if (raw_points[p][0] > 0) {
                    uint16_t sx, sy;
                    XPT2046_ConvertToScreen(raw_points[p][0], raw_points[p][1], &sx, &sy);
                    
