valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
                    int32_t dx = (int32_t)sx - (int32_t)cal_points[p][0];
                    int32_t dy = (int32_t)sy - (int32_t)cal_points[p][1];
                    total_error += dx * dx + dy * dy;
                }
            }
            
            printf("Mode %d: error=%ld\r\n", mode, total_error);
            
            if (total_error < best_error) {
                best_error = total_error;
                best_mode = mode;
            }
        }
        
        XPT2046_SetCoordMode(best_mode);
        printf("==> Best mode: %d (error=%ld)\r\n", best_mode, best_error);
        
        /* Uğurlu mesaj */
        ILI9341_DrawString(60, 60, "CALIBRATED!", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 2);
        
        char mode_str[32];
        sprintf(mode_str, "Mode: %d", best_mode);
        ILI9341_DrawString(100, 100, mode_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 2);
        
        const char* mode_desc[] = {
            "Normal", "Swap+InvX", "InvBoth", "SwapOnly",
            "InvX", "InvY", "Swap+InvY", "Swap+InvBoth"
        };
        ILI9341_DrawString(60, 140, mode_desc[best_mode], ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
        
        /* Kalibrasiya məlumatlarını yaz */
        if (points_collected == 3) {
            XPT2046_SetCalibrationPoint(0, raw_points[0][0], raw_points[0][1]);
            XPT2046_SetCalibrationPoint(1, raw_points[1][0], raw_points[1][1]);
            XPT2046_SetCalibrationPoint(2, raw_points[2][0], raw_points[2][1]);
            XPT2046_FinishCalibration();
        }
        
        ILI9341_DrawString(20, 180, "Touch any corner to", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 1);
        ILI9341_DrawString(20, 200, "change mode later", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 1);
        
        HAL_Delay(1500);
    } else {
        /* Heç bir nöqtə alınmadı - default mode 3 (SwapOnly) */
        /* Mode 3 əksər landscape ekranlar üçün işləyir */
        XPT2046_SetCoordMode(3);
        
        printf("No calibration points - using mode 3 (SwapOnly)\r\n");
        
        ILI9341_DrawString(40, 60, "NO CALIBRATION", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 2);
        ILI9341_DrawString(40, 100, "Using Mode 3", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 1);
        ILI9341_DrawString(40, 120, "(SwapOnly)", ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
        ILI9341_DrawString(20, 160, "Touch corners to", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 1);
        ILI9341_DrawString(20, 180, "change mode later", ILI9341_COLOR_WHITE, ILI9341_COLOR_BLACK, 1);
        
        HAL_Delay(1500);
    }
    
    printf("=== TOUCH CALIBRATION COMPLETE ===\r\n");
    return 1;
}
